apple-open-source/macos/IOUSBFamily/AppleUSBXHCI/Headers/AppleUSBXHCIUIM.h
/*
 *  AppleUSBXHCIUIM.h
 *
 *  Copyright © 2011-2012 Apple Inc. All Rights Reserved. 
 *
 */

#ifndef _APPLEUSBXHCIUIM_H_
#define _APPLEUSBXHCIUIM_H_


//================================================================================================
//
//   Headers
//
//================================================================================================
//
#include <IOKit/IOFilterInterruptEventSource.h>

#include <IOKit/usb/IOUSBLog.h>
#include <IOKit/usb/IOUSBControllerV3.h>
#include <IOKit/usb/USBTracepoints.h>

#include "AppleUSBXHCI_IsocQueues.h"
#include "AppleUSBXHCI_RootHub.h"
#include "XHCI.h"


#define kMaxImmediateTRBTransferSize        8        
#define kInvalidImmediateTRBTransferSize    0xFF        

#include "AppleUSBXHCI_AsyncQueues.h"

//================================================================================================
//
//   Local Definitions
//
//================================================================================================
//
#ifdef __ppc__
#define IOSync eieio
#else
#define IOSync() __asm__ __volatile__ ( "mfence" : : : "memory" )
#endif

// Define this to check read buffer for usage
#define DEBUG_BUFFER (0)
// Define this to print out isoc completions, not compatible with DEBUG_BUFFER
#define DEBUG_ISOC (0)
// Define this to check which register returns invalid value
#define DEBUG_REGISTER_READS (0)

// Define this to intercept completions
#define DEBUG_COMPLETIONS (0)

#define XHCIInvalidRegisterValue        0xFFFFFFFF				// if a register returns this value, the controller is likely gone

#define kNoStreamID                     0
#define kXHCIIsochMaxBusStall			25000

#define INITIAL_TRANSFER_RING_PAGES (1)


typedef IOUSBCommand *IOUSBCommandPtr;
typedef IOUSBIsocCommand *IOUSBIsocCommandPtr;
typedef void *voidPtr;


struct ringStruct
{
	IOBufferMemoryDescriptor   *TRBBuffer;					  // Also use as test for ring existance
	TRB                        *transferRing;
	USBPhysicalAddress64		transferRingPhys;
	UInt16						transferRingSize;
    UInt16						transferRingPages;
	UInt32						transferRingPCS;
	volatile UInt16				transferRingEnqueueIdx;
	volatile UInt16				transferRingDequeueIdx;
	UInt16						lastSeenDequeIdx;
	UInt32						lastSeenFrame;
	TRB							stopTRB;
	UInt64						nextIsocFrame;			  // For Isoc endpoints only
    UInt8                       endpointType;             // cntrl, bulk, isoc, int
	void                       *pEndpoint;                // Type AppleXHCIIsochEndpoint or AppleXHCIAsyncEndpoint
    UInt8						slotID;
    UInt8						endpointID;
	bool                        beingReturned;
	bool                        beingDeleted;
    bool						needsDoorbell;
};
typedef struct ringStruct
XHCIRing,
*ringPtr;


struct slotStruct
{
	IOBufferMemoryDescriptor *	buffer;
	Context	*					deviceContext;
	Context64 *					deviceContext64;
	USBPhysicalAddress64		deviceContextPhys;
	UInt32						potentialStreams[kXHCI_Num_Contexts];     // How many streams the endpoint could support
	UInt32						maxStream[kXHCI_Num_Contexts];            // How many streams the endpoint is configured for
	XHCIRing *					rings[kXHCI_Num_Contexts];
    bool 						deviceNeedsReset;
};
typedef struct slotStruct
slot,
*slotPtr;

#define MAKEXHCIERR(CC) (-1000-CC)



enum 
{
	// If this errata bit is set don't rely on Event Data TRBs.
	kXHCIErrata_NoEDs = kXHCIBit0,
	// If this errate bit is set, don't use MSI interrupts.
	kXHCIErrata_NoMSI = kXHCIBit1,
	// If this bit is set there is a Panther point style mux to switch between EHCI/XHCI
	kXHCIErrataPPT = kXHCIBit2,

    // NEC Controller, check the firmware
	kXHCIErrata_NEC = kXHCIBit3,

    kXHCIErrata_EnableAutoCompliance = kXHCIBit4,

    kXHCIErrataPPTMux  = kXHCIBit5,
	
	kXHCIErrata_Rensas = kXHCIBit6,
	
	kXHCIErrata_FrescoLogic = kXHCIBit7,
    
    kXHCIErrata_ParkRing = kXHCIBit8,
	
	kXHCIErrata_FL1100_Ax = kXHCIBit9,
	    
	kXHCIErrata_ASMedia = kXHCIBit10,
	
	kXHCIErrata_Etron7052 = kXHCIBit11,
    
    kXHCI_MIN_NEC = 0x3028,
	
#if DEBUG_BUFFER
	// These for debugging buffer
	kXHCI_ScratchMark           = 0,
	kXHCI_ScratchMMap           = 1,
	kXHCI_ScratchPat            = 2,
#else
	kXHCI_ScratchdbFrIndex      = 0,
#endif
    
	// These for timeouts
	kXHCI_ScratchStopDeq        = 3,
	kXHCI_ScratchBytes          = 4,
	
	kXHCI_ScratchFirstSeen      = 5,
	kXHCI_ScratchTRTime         = 6,

	// These for Isoc completions
	kXHCI_ScratchFrIndex        = 7,
	kXHCI_ScratchLastTRB        = 8,
	
	// For kXHCIErrata_NoEDs
	kXHCI_ScratchShortfall      = 9,
};

// XHCI config registers to use xMux
enum {
    kXHCI_XUSB2PR			= 0xD0, // set in UIMInitialize
    kXHCI_XUSB2PRM			= 0xD4,	// set in EFI to 0xf
	kXHCI_XUSB3_PSSEN		= 0xD8, // set in UIMInitialize
	kXHCI_XUSB3PRM			= 0xDC  // set in EFI to 0xf
};

enum{
	kMaxSavePortStatus = 16,
	kMaxPorts = 15,
	kMaxSlots = 256,
	kMaxDevices = 128,
	kMaxStreamsPerEndpoint = 256,
    kMaxInterrupters = 16,
    kPrimaryInterrupter = 0,
    kTransferInterrupter = 1,
    
    // Tuning parameter, try to close a fragment  
    // if it uses more than this many TRBs.
	kMaxEndpointsPerDevice  = 31,
    
    kEntriesInEventRingSegmentTable = 1,
    kInterruptModerationInterval = 160,
};


#define kMaxXHCIControllerEndpoints		(kMaxEndpointsPerDevice * kMaxSlots)

#define kMaxHCPortMethods       15
#define kHCPortMethodNameLen    5

// These methods come from Xhci.asl file from EFI
const char xhciMuxedPorts[kMaxHCPortMethods][kHCPortMethodNameLen] = {"XHCA","XHCB","XHCC","XHCD"};

enum 
{
	kControllerEHCI	= 0x00,
	kControllerXHCI	= 0x01
};

enum 
{
	kACPIParamaterCount = 0x01
};

class AppleUSBXHCI;
class AppleXHCIAsyncEndpoint;

typedef void (*CMDComplete)(AppleUSBXHCI*, TRB *, SInt32 *);

typedef struct XHCICommandCompletion
{
	CMDComplete		completionAction;
	SInt32			parameter;
} XHCICommandCompletion;

typedef struct XHCIInterrupter
{
    // Integers

	// Indices, etc used by filter keep these together
    UInt16									EventRingDequeueIdx;    // Dequeue pointer for hardware ring
 	volatile UInt16							EventRing2DequeueIdx;   // Dequeue pointer for software ring
	volatile UInt16							EventRing2EnqueueIdx;   // Enqueue pointer for software ring
	UInt8									EventRingCCS;           // consumer cycle state for hardware ring, only LSB used.
    bool                                    EventRingDPNeedsUpdate; // Need to update deque pointer for hardware ring

	UInt16									numEvents;              // Number of Event TRBS in hardware event ring
	UInt16									numEvents2;             // Number of Event TRBS in software event ring
	
	volatile SInt32							EventRing2Overflows;    // Count of overflows copying to software ring

    // Pointers. (32/64 bits each)
    
