apple-open-source/macos/IOUSBFamily/AppleUSBXHCI/Headers/AppleUSBXHCIUIM.h
	TRB										*EventRing;             // logical pointer for hardware ring
	TRB                                     *EventRing2;            // logical pointer to software ring
	USBPhysicalAddress64					EventRingPhys;          // physical pointer to event ring for hardware ring
	USBPhysicalAddress64					EventRingSegTablePhys;  // physical pointer seg table for hardware ring
    IOBufferMemoryDescriptor                *EventRingBuffer;       // IOMem buffer for hardware ring 
	

#if __LP64__
    UInt64                                  Pad1;
#else    
    UInt32                                  Pad1;
    UInt32                                  Pad2;
    UInt32                                  Pad3;
    UInt32                                  Pad4;
    UInt32                                  Pad5;
#endif
}
XHCIInterrupter __attribute__((aligned(64)));

OSCompileAssert ( sizeof ( XHCIInterrupter ) == 64 );

class AppleUSBXHCI : public IOUSBControllerV3
{
    
    OSDeclareDefaultStructors(AppleUSBXHCI)
	
	friend	class AppleXHCIIsochTransferDescriptor;
    friend  class AppleXHCIAsyncEndpoint;
    
protected:
    IOMemoryMap								*_deviceBase;
    UInt16									_vendorID;
    UInt16									_deviceID;
    UInt16									_revisionID;
    UInt32									_errataBits;						// various bits for chip erratas
	XHCICapRegistersPtr						_pXHCICapRegisters;					// Capabilities registers
    XHCIRegistersPtr						_pXHCIRegisters;					// Pointer to base address of XHCI registers.
	XHCIRunTimeRegPtr						_pXHCIRuntimeReg;					// Pointer to base of runtime regs
	XHCIXECPRegistersPtr					_pXHCIXECPRegistersBase;
	UInt32									*_pXHCIDoorbells;
    UInt32                                  _maxPrimaryStreams;
    UInt16									_rootHubFuncAddressSS;				// Function Address for the XHCI Root hub SS
    UInt16									_rootHubFuncAddressHS;				// Function Address for the XHCI Root hub HS
    IOFilterInterruptEventSource			*_filterInterruptSource;
    static void								InterruptHandler(OSObject *owner, IOInterruptEventSource * source, int count);
    static bool								PrimaryInterruptFilter(OSObject *owner, IOFilterInterruptEventSource *source);
    bool									FilterInterrupt(int index);
	
	UInt16									_numDeviceSlots;					// Number of device slots this XHCI supports
	IOBufferMemoryDescriptor				*_DCBAABuffer;						// IOMem buffer for the device context array
	USBPhysicalAddress64					*_DCBAA;							// logical pointer to DCBAA
	USBPhysicalAddress64					_DCBAAPhys;							// physical pointer to DCBAA
    
	// For the command ring
	UInt16									_numCMDs;							// Number of CMD TRBS in CMD ring
	IOBufferMemoryDescriptor				*_CMDRingBuffer;					// IOMem buffer 
	TRB										*_CMDRing;							// logical pointer 
	USBPhysicalAddress64					_CMDRingPhys;						// physical pointer
	UInt16									_CMDRingEnqueueIdx;					// Enqueue index
	UInt16									_CMDRingDequeueIdx;
	UInt32									_CMDRingPCS;						// producer cycle state
	XHCICommandCompletion *					_CMDCompletions;
	
	// For the Event ring
	UInt16									_ERSTMax;                           // max nuumber of Event TRBS in primary event ring
	UInt16									_MaxInterrupters;                   // max nuumber MSI (or MSI-X) interrupters.
    XHCIInterrupter                         _events[kMaxInterrupters];
    Interrupter								_savedInterrupter[kMaxInterrupters];// Save space for the hardware registers

	// Other bad events the primary filter saw
	volatile SInt32							_DebugFlag;
	volatile SInt32							_CCEPhysZero;
	volatile SInt32							_CCEBadIndex;
	volatile SInt32							_EventChanged;
	volatile SInt32							_IsocProblem;
    
	// For the input context
	UInt32									_inputContextLock;
	IOBufferMemoryDescriptor				*_inputContextBuffer;
	Context									*_inputContext;
    Context64								*_inputContext64;
	USBPhysicalAddress64					_inputContextPhys;
    
	
	// Scratchpad buffers
	UInt16									_numScratchpadBufs;
	IOBufferMemoryDescriptor				*_SBABuffer;						// IOMem buffer for the Scratchpad Buffer Array
	USBPhysicalAddress64					*_SBA;								// logical pointer to SBA
	USBPhysicalAddress64					_SBAPhys;							// physical pointer to SBA
	OSArray									*_ScratchPadBuffs;				
	
	// Other stuff
	
	slot									_slots[kMaxSlots];
	UInt8									_devHub[kMaxDevices];
	UInt8									_devPort[kMaxDevices];
	UInt8									_devMapping[kMaxDevices];
	bool									_devEnabled[kMaxDevices];
	UInt16									_devZeroPort;						// Port dev zero is attached to
	UInt16									_devZeroHub;						// Hub (controller's ID for) dev zero is attached to
	bool									_fakedSetaddress;
	volatile SInt16							_configuredEndpointCount;
	SInt16									_maxControllerEndpoints;			// the max number of endpoints that this controller
    // can handle.
	bool                                    _uimInitialized;
    volatile bool							_filterInterruptActive;				// in the filter interrupt routine
	volatile UInt64							_frameNumber64;
	UInt8									_istKeepAwayFrames;					// the isochronous schedule threshold keepaway
	UInt32									_numInterrupts;
	UInt32									_numPrimaryInterrupts;
	UInt32									_numInactiveInterrupts;
	UInt32									_numUnavailableInterrupts;
	
	XHCIRegisters							_savedRegisters;
	bool									_stateSaved;
	bool									_synthesizeCSC[kMaxPorts];		
	bool									_prevSuspend[kMaxPorts];
	bool									_suspendChangeBits[kMaxPorts];
	bool									_rhPortBeingResumed[kMaxPorts];			// while we are outside the WL resuming a root hub port
    bool                                    _rhPortBeingReset[kMaxPorts];           // while we are outside the WL resetting a root hub port
	thread_call_t							_rhResumePortTimerThread[kMaxPorts];	// thread off the WL gate to resume a RH port
    thread_call_t                           _rhResetPortThread[kMaxPorts];          // thread off the WL gate to reset a RH port
    XHCIRootHubResetParams                  _rhResetParams[kMaxPorts];              // Used to pass information to the callout thread and back
    bool                                    _portIsDebouncing[kMaxPorts];           // Indicates that the port is being debounced
	bool									_debouncingADisconnect[kMaxPorts];		// If true, we are debouncing a disconnect.  If false, we are debouncing a connection
	UInt64                                  _debounceNanoSeconds[kMaxPorts];        // Timestamp for when the port started being debounced
	bool                                    _portIsWaitingForWRC[kMaxPorts];        // Indicates that the port is waiting for a WRC change to complete
   
	bool									_hasPCIPwrMgmt;
	UInt32									_ExpressCardPort;						// port number (1-based) where we have an ExpressCard connector
	bool									_badExpressCardAttached;				// True if a driver has identified a bad ExpressCard
    
	volatile UInt32							_debugCtr;
	volatile UInt32							_debugPattern;
	
	UInt16									_saveStatus[kMaxSavePortStatus];
	UInt16									_saveChange[kMaxSavePortStatus];
    
