apple-open-source/macos/IOUSBFamily/AppleUSBXHCI/Headers/AppleUSBXHCIUIM.h
    SInt16                                   _contextInUse;
    
    UInt16                                  _NECControllerVersion;
    
    bool                                    _AC64;
    bool                                    _Contexts64;
    
	IOACPIPlatformDevice					*_acpiDevice;
	bool									_muxedPorts;
    bool                                    _discoveredMuxedPorts;
    bool									_testModeEnabled;
	UInt32                                  *_pXHCIPPTChickenBits;
    
    IOSimpleLock *							_isochScheduleLock;					// used to disable preemption during isoch scheduling
    
    // variables to get the anchor frame
	AbsoluteTime							_tempAnchorTime;
	AbsoluteTime							_anchorTime;
	UInt64									_tempAnchorFrame;
	UInt64									_anchorFrame;
    bool                                    _waitForCommandRingStoppedEvent;
	bool									_lostRegisterAccess;
    
    bool                                    _HSEReported;
    IOBufferMemoryDescriptor               *_DummyBuffer;
    USBPhysicalAddress64                    _DummyRingPhys;
    UInt32                                  _DummyRingCycleBit;
    
private:
    // These methods come from Xhci.asl file from EFI
    char                                    ehciMuxedPorts[kMaxHCPortMethods][kHCPortMethodNameLen];
    
private:
    
	static int DiffTRBIndex(USBPhysicalAddress64 t1, USBPhysicalAddress64 t2);
	
	SInt32 MakeXHCIErrCode(int CC){return(MAKEXHCIERR(CC));}
	XHCIRing *GetRing(int slotID, int endpointID, UInt32 stream);
	XHCIRing *CreateRing(int slotID, int endpointID, UInt32 maxStream);
	XHCIRing *FindStream(int slotID, int endpointID, USBPhysicalAddress64 phys, int *index, bool quiet);
	void SetVendorInfo(void);
	UInt32 GetErrataBits(UInt16 vendorID, UInt16 deviceID, UInt16 revisionID);
	IOReturn MakeBuffer(IOOptionBits options, 
						mach_vm_size_t size, 
						mach_vm_address_t mask, 
						IOBufferMemoryDescriptor **buffer, 
						void **logical, 
						USBPhysicalAddress64 *physical);
	IOReturn AllocStreamsContextArray(XHCIRing *ringX, UInt32 maxStream);
	IOReturn AllocRing(XHCIRing *ringX, int size_in_pages=INITIAL_TRANSFER_RING_PAGES);
    void DeallocRing(XHCIRing *ring);
    void ParkRing(XHCIRing *ring);
#if 0
    IOReturn ExpandRing(XHCIRing *ringX);
#endif
    IOReturn InitAnEventRing(int IRQ);
    void FinalizeAnEventRing(int IRQ);
	void InitCMDRing(void);
	void InitEventRing(int IRQ, bool reinit=false);
	IOReturn MungeXHCIStatus(int code, bool in, UInt8 speed = kUSBDeviceSpeedSuper, bool silent = false);
	IOReturn MungeCommandCompletion(int code, bool silent = false);
	int GetEndpointID(int endpointNumber, short direction);
    int GetSlotID(int functionNumber);
	int CountRingToED(XHCIRing *ring, int index, UInt32 *shortfall, bool advance);
	int FreeSlotsOnRing(XHCIRing *ring);
    bool CanTDFragmentFit(XHCIRing *ring, UInt32 fragmentTransferSize);
	SInt32 WaitForCMD(TRB *t, int command, CMDComplete callBackF=0);
	void ResetEndpoint(int slotID, int EndpointID);
    int StartEndpoint(int slotID, int EndpointID, UInt16 streamID=0);
    void ClearStopTDs(int slotID, int EndpointID);
	int StopEndpoint(int slotID, int EndpointID);
    int QuiesceEndpoint(int slotID, int endpointID);
	void ClearEndpoint(int slotID, int EndpointID);
	IOReturn ReturnAllTransfersAndReinitRing(int slotID, int EndpointID, UInt32 streamID);
	IOReturn ReinitTransferRing(int slotID, int EndpointID, UInt32 streamID);
	void RestartStreams(int slotID, int EndpointID, UInt32 except);
	int SetTRDQPtr(int slotID, int EndpointID, UInt32 stream, int dQindex);
	bool FilterEventRing(int IRQ, bool *needsSignal);
    void DoStopCompletion(TRB *nextEvent);
    bool DoCMDCompletion(TRB nextEvent, UInt16 eventIndex);
    void PollForCMDCompletions(int IRQ);
	bool PollEventRing2(int IRQ);
	void SetTRBAddr64(TRB * CMD, USBPhysicalAddress64 addr);
	void SetStreamCtxAddr64(StreamContext * strc, USBPhysicalAddress64 addr, int sct, UInt32 pcs);
	void SetTRBDCS(TRB * CMD, bool DCS);
    SInt16 DecConfiguredEpCount();
    SInt16 IncConfiguredEpCount();
    IOReturn TestConfiguredEpCount();
    bool IsStreamsEndpoint(int slotID, int EndpointID);
	
	// Register Accessors
	UInt64 Read64Reg(volatile UInt64 *addr);
	void Write64Reg(volatile UInt64 *addr, UInt64 value, bool quiet=false);
	void Write32Reg(volatile UInt32 *addr, UInt32 value);
	UInt8 Read8Reg(volatile UInt8 *addr);
	UInt16 Read16Reg(volatile UInt16 *addr);
	UInt32 Read32Reg(volatile UInt32 *addr);
	bool CheckControllerAvailable(bool quiet=false);
	
	// Endpoint Context Accessors
	void SetDCBAAAddr64(USBPhysicalAddress64 * el, USBPhysicalAddress64 addr);
	void SetEPCtxDQpAddr64(Context * ctx, USBPhysicalAddress64 addr);
	USBPhysicalAddress64 GetEpCtxDQpAddr64(Context * ctx);
	int GetEpCtxEpState(Context * ctx);
	void SetEPCtxEpType(Context * ctx, int t);
	UInt8 GetEpCtxEpType(Context * ctx);
	UInt8 GetEPCtxInterval(Context * ctx);
	void SetEPCtxInterval(Context * ctx, UInt8 interval);
	void SetEPCtxMPS(Context * ctx, UInt16 mps);
	UInt16 GetEpCtxMPS(Context * ctx);
    UInt16 GetEPCtxMult(Context * ctx);
	void SetEPCtxMult(Context * ctx, UInt16 mult);
    UInt16 GetEPCtxMaxBurst(Context * ctx);
	void SetEPCtxMaxBurst(Context * ctx, UInt16 maxBurst);
	void SetEPCtxCErr(Context * ctx, UInt32 cerr);
	void SetEPCtxMaxPStreams(Context * ctx, int maxPStreams);
	void SetEPCtxLSA(Context * ctx, int state);
	void SetEPCtxDCS(Context * ctx, int state);
	void SetEPCtxAveTRBLen(Context * ctx, UInt32 len);
	void SetEPCtxMaxESITPayload(Context * ctx, UInt32 len);
    
	// Slot Context Accessors
	void SetSlCtxEntries(Context * ctx, UInt32 speed);
	UInt8 GetSlCtxEntries(Context * ctx);
	void SetSlCtxSpeed(Context * ctx, UInt32 speed);
	UInt8 GetSlCtxSpeed(Context * ctx);
	UInt32 GetSlCtxRootHubPort(Context * ctx);
	void SetSlCtxRootHubPort(Context * ctx, UInt32 rootHubPort);
	void SetSlCtxTTPort(Context * ctx, UInt32 port);
	int GetSlCtxTTPort(Context * ctx);
	void SetSlCtxTTSlot(Context * ctx, UInt32 slot);
	int GetSlCtxTTSlot(Context * ctx);
    void SetSlCtxInterrupter(Context * ctx, UInt32 interrupter);
    UInt32 GetSlCtxInterrupter(Context * ctx);
	UInt32 GetSlCtxRouteString(Context * ctx);
	void SetSlCtxRouteString(Context * ctx, UInt32 string);
	void ResetSlCtxNumPorts(Context * ctx, UInt32 num);
	void ResetSlCtxTTT(Context * ctx, UInt32 num);
	void SetSlCtxMTT(Context * ctx, bool multiTT);
	bool GetSlCtxMTT(Context * ctx);
	int GetSlCtxSlotState(Context * ctx);
	int GetSlCtxUSBAddress(Context * ctx);
    
	// TRB accessors
	void SetTRBType(TRB * CMD, int t);
	int GetTRBType(TRB * trb);
	int GetTRBSlotID(TRB * trb);
	void SetTRBSlotID(TRB * trb, UInt32 slotID);
	void SetTRBEpID(TRB * trb, UInt32 slotID);
    void SetTRBStreamID(TRB * trb, UInt32 streamID);
	int GetTRBCC(TRB * trb);
	bool IsIsocEP(int slotID, UInt32 endpointIdx);
	void SetTRBCycleBit(TRB *trb, int state);
	void SetTRBChainBit(TRB *trb, int state);
    bool GetTRBChainBit(TRB *trb);
	void SetTRBBSRBit(TRB *trb, int state);
	IOReturn EnqueCMD(TRB *trb, int type, CMDComplete callBackFn, SInt32 **param);
	void ClearTRB(TRB *trb, bool clearCCS);
	void PrintCapRegs(void);
	void PrintRuntimeRegs(void);
	void PrintInterrupter(int level, int IRQ, const char *s);
	void PrintTRB(int level, TRB *trb, const char *s, UInt32 offsC=0);
	// these methods all send the TRB to usbtracer
    void PrintTransferTRB(TRB *trb, XHCIRing* ringX, int indexInRing, UInt32 offsC=0 );
    void PrintEventTRB(TRB *trb, int irq, bool inFilter, XHCIRing* otherRing = NULL );
    void PrintCommandTRB(TRB *trb);
	
	void PrintContext(Context * ctx);
	void PrintSlotContexts(void);
	void PrintCCETRB(TRB *trb);
    void PrintRing(XHCIRing *ring);
    
    bool IsStillConnectedAndEnabled(int SlotID);
    IOReturn AddDummyCommand(XHCIRing *ringX, IOUSBCommand *command);
	void CompleteSlotCommand(TRB *t, void *p);
	void CompleteNECVendorCommand(TRB *t, void *p);
    
	void GetInputContext(void);
	void ReleaseInputContext(void);
	Context * GetContextFromDeviceContext(int SlotID, int contextIdx);
	Context * GetEndpointContext(int SlotID, int EndpointID);
	Context * GetSlotContext(int SlotID);
	Context * GetInputContextByIndex(int index);

	IOReturn AddressDevice(UInt32 slotID, UInt16 maxPacketSize, bool setAddr, UInt8 speed, int highSpeedHubSlot, int highSpeedPort);
    
