apple-open-source/macos/IOUSBFamily/AppleUSBXHCI/Headers/AppleUSBXHCIUIM.h
	static void                 RHResumePortTimerEntry(OSObject *target, thread_call_param_t port);
    static void                 RHResetPortEntry(OSObject *target, thread_call_param_t port);
    
	void                        RHResumePortTimer(UInt32 port);
    IOReturn                    RHResetPort(UInt8 RHSpeed, UInt16 adjustedPort);
    
	static IOReturn             RHResumePortCompletionEntry(OSObject *target, void *param1, void *param2, void *param3, void *param4);
	IOReturn                    RHResumePortCompletion(UInt32 port);
	IOReturn                    RHCompleteResumeOnAllPorts();
    void RHCheckForPortResumes(void);
    
    void SaveAnInterrupter(int IRQ);
    void RestoreAnInterrupter(int IRQ);
	
	void TestCommands(void);
	bool CheckNECFirmware(void);
	IOReturn TestFn(int param);
	void CheckSleepCapability(void);
	
#if DEBUG_BUFFER
	void CheckBuf(IOUSBCommand* command);
#endif
	
    IOReturn GenerateNextPhysicalSegment(TRB *t, IOByteCount *req, UInt32 bufferOffset, IODMACommand *dmaCommand);
	
    TRB *GetNextTRB(XHCIRing *ring, void *xhciTD, TRB **StartofFragment, bool firstFragment);
    
    void PutBackTRB(XHCIRing *ring, TRB *t);
    
	IOReturn CreateStream(int       slotID,
                          int       endpointIdx,
						  UInt32    stream);
    
    void     DeleteStreams(int      slotID, 
                           int      endpointIdx);
    
	IOReturn CreateEndpoint(int							slotID,
							int							endpointIdx,
							UInt16						maxPacketSize,
							short						pollingRate,
							int							epType,
							UInt8						maxStream,
							UInt8						maxBurst,
							UInt8						mult,
							void                        *pEP);
	
	IOReturn BuildRHPortBandwidthArray(OSArray *rhPortArray);
	
	IOReturn CheckPeriodicBandwidth(int			slotID,
                                    int			endpointIdx,
                                    UInt16		maxPacketSize,
                                    short		pollingRate,
                                    int			epType,
                                    UInt8		maxStream,
                                    UInt8		maxBurst,
									UInt8		mult);
	IOReturn CreateTransfer(IOUSBCommand* command, UInt32 stream);
    void PrintTRBs(XHCIRing *ringX, const char *s, TRB *StartofFragment, TRB *end);
    void CloseFragment(XHCIRing *ringX, TRB *StartofFragment, UInt32 offsC1);
    int FindSlotFromPort(UInt16 port);

    
	IOReturn _createTransfer(void       *xhciTD, 
                            bool        isoc,
                            IOByteCount req, 
                            UInt32      offsC0=0, 
                            UInt64      runningOffset=0, 
                            bool        interruptNeeded = false, 
                            bool        fragmentedTDs = false,                             
                            UInt32      *firstTRBIndex = NULL, 
                            UInt32      *numTRBs=NULL,
							bool		noLogging = false,                            
                            SInt16      *completionIndex = NULL);

#if DEBUG_COMPLETIONS
	// Overriding the controller method
	void Complete(
                  IOUSBCompletion	completion,
                  IOReturn		status,
                  UInt32		actualByteCount = 0 );
#endif
	IOReturn	HCSelect ( UInt8 port, UInt8 controllerType );
    IOReturn	HCSelectWithMethod ( char *muxMethod );
	bool		DiscoverMuxedPorts();
    IOReturn    ResetController();
	void        EnableXHCIPorts();
	bool        HasMuxedPorts();
    IOReturn    QuiesceAllEndpoints ();
    
public:
	
	virtual bool		init(OSDictionary * propTable);
    virtual IOReturn 	message( UInt32 type, IOService * provider,  void * argument = 0 );
    virtual bool        terminate( IOOptionBits options = 0);
	virtual bool		willTerminate(IOService *provider, IOOptionBits options);

	virtual void		powerChangeDone ( unsigned long fromState );
    
    
    
    IOReturn UIMInitialize(IOService * provider);
    IOReturn UIMFinalize();
    
    
    
    // Control
    virtual IOReturn UIMCreateControlEndpoint(UInt8				functionNumber,
                                              UInt8				endpointNumber,
                                              UInt16			maxPacketSize,
                                              UInt8				speed);
    
    virtual IOReturn UIMCreateControlEndpoint(UInt8				functionNumber,
                                              UInt8				endpointNumber,
                                              UInt16			maxPacketSize,
                                              UInt8				speed,
                                              USBDeviceAddress  highSpeedHub,
                                              int			    highSpeedPort);
    
    // method in 1.8 and 1.8.1
    virtual IOReturn UIMCreateControlTransfer(short				functionNumber,
                                              short				endpointNumber,
                                              IOUSBCompletion	completion,
                                              void				*CBP,
                                              bool				bufferRounding,
                                              UInt32			bufferSize,
                                              short				direction);
    //same method in 1.8.2
    virtual IOReturn UIMCreateControlTransfer(short					functionNumber,
                                              short					endpointNumber,
                                              IOUSBCommand*			command,
                                              IOMemoryDescriptor	*CBP,
                                              bool					bufferRounding,
                                              UInt32				bufferSize,
                                              short					direction);
    // method in 1.8 and 1.8.1
    virtual IOReturn UIMCreateControlTransfer(short					functionNumber,
                                              short					endpointNumber,
                                              IOUSBCompletion		completion,
                                              IOMemoryDescriptor	*CBP,
                                              bool					bufferRounding,
                                              UInt32				bufferSize,
                                              short					direction);
    
    virtual IOReturn UIMCreateControlTransfer(short				functionNumber,
                                              short				endpointNumber,
                                              IOUSBCommand		*command,
                                              void				*CBP,
                                              bool				bufferRounding,
                                              UInt32			bufferSize,
                                              short				direction);
    
    
    // Bulk
    virtual IOReturn UIMCreateBulkEndpoint(UInt8				functionNumber,
                                           UInt8				endpointNumber,
                                           UInt8				direction,
                                           UInt8				speed,
                                           UInt8				maxPacketSize);
    
