apple-open-source/macos/IOUSBFamily/AppleUSBXHCI/Headers/AppleUSBXHCIUIM.h
    IOReturn CreateBulkEndpoint(UInt8       functionNumber,
                                UInt8     endpointNumber,
                                UInt8     direction,
                                UInt8     speed,
                                UInt16    maxPacketSize,
                                USBDeviceAddress  highSpeedHub,
                                int       highSpeedPort,
                                UInt32    maxStream,
                                UInt32    maxBurst);
	
    virtual IOReturn UIMCreateStreams(UInt8				functionNumber,
                                      UInt8				endpointNumber,
                                      UInt8				direction,
                                      UInt32            maxStream);
    
    virtual IOReturn UIMCreateSSBulkEndpoint(
                                             UInt8		functionNumber,
                                             UInt8		endpointNumber,
                                             UInt8		direction,
                                             UInt8		speed,
                                             UInt16		maxPacketSize,
                                             UInt32       maxStream,
                                             UInt32       maxBurst);
	
    virtual IOReturn UIMCreateBulkEndpoint(UInt8				functionNumber,
                                           UInt8				endpointNumber,
                                           UInt8				direction,
                                           UInt8				speed,
                                           UInt16				maxPacketSize,
                                           USBDeviceAddress    	highSpeedHub,
                                           int					highSpeedPort);
    
    
    
    // method in 1.8 and 1.8.1
    virtual IOReturn UIMCreateBulkTransfer(short				functionNumber,
                                           short				endpointNumber,
                                           IOUSBCompletion		completion,
                                           IOMemoryDescriptor   *CBP,
                                           bool					bufferRounding,
                                           UInt32				bufferSize,
                                           short				direction);
    
    // same method in 1.8.2
    virtual IOReturn UIMCreateBulkTransfer(IOUSBCommand* command);
    
    // Interrupt
    virtual IOReturn UIMCreateInterruptEndpoint(short				functionAddress,
                                                short				endpointNumber,
                                                UInt8				direction,
                                                short				speed,
                                                UInt16				maxPacketSize,
                                                short				pollingRate);
    
    virtual IOReturn UIMCreateInterruptEndpoint(short				functionAddress,
                                                short				endpointNumber,
                                                UInt8				direction,
                                                short				speed,
                                                UInt16				maxPacketSize,
                                                short				pollingRate,
                                                USBDeviceAddress    highSpeedHub,
                                                int                 highSpeedPort);
    
    IOReturn CreateInterruptEndpoint(short     functionAddress,
                                     short     endpointNumber,
                                     UInt8     direction,
                                     short     speed,
                                     UInt16    maxPacketSize,
                                     short     pollingRate,
                                     USBDeviceAddress  highSpeedHub,
                                     int       highSpeedPort,
                                     UInt32    maxBurst);
    
    virtual IOReturn UIMCreateSSInterruptEndpoint(
                                                  short		functionAddress,
                                                  short		endpointNumber,
                                                  UInt8		direction,
                                                  short		speed,
                                                  UInt16		maxPacketSize,
                                                  short		pollingRate,
                                                  UInt32   maxBurst);
    
    // method in 1.8 and 1.8.1
    virtual IOReturn UIMCreateInterruptTransfer(short				functionNumber,
                                                short				endpointNumber,
                                                IOUSBCompletion		completion,
                                                IOMemoryDescriptor  *CBP,
                                                bool				bufferRounding,
                                                UInt32				bufferSize,
                                                short				direction);
    
    
    // method in 1.8.2
    virtual IOReturn UIMCreateInterruptTransfer(IOUSBCommand* command);
    
    // Isoch
    virtual IOReturn UIMCreateIsochEndpoint(short				functionAddress,
                                            short				endpointNumber,
                                            UInt32				maxPacketSize,
                                            UInt8				direction);
    
    virtual IOReturn UIMCreateIsochEndpoint(short				functionAddress,
                                            short				endpointNumber,
                                            UInt32				maxPacketSize,
                                            UInt8				direction,
                                            USBDeviceAddress    highSpeedHub,
                                            int                 highSpeedPort);
    
    virtual IOReturn UIMCreateIsochEndpoint(short				functionAddress,
                                            short				endpointNumber,
                                            UInt32				maxPacketSize,
                                            UInt8				direction,
                                            USBDeviceAddress    highSpeedHub,
                                            int					highSpeedPort,
                                            UInt8				interval);
	
