apple-open-source/macos/IOUSBFamily/AppleUSBXHCI/Headers/AppleUSBXHCIUIM.h
    IOReturn CreateIsochEndpoint(short				functionAddress,
                                 short				endpointNumber,
                                 UInt32				maxPacketSize,
                                 UInt8				direction,
                                 UInt8				interval,
                                 UInt8				maxBurst,
								 UInt8				mult);
    
    virtual IOReturn UIMCreateSSIsochEndpoint(
                                              short				functionAddress,
                                              short				endpointNumber,
                                              UInt32			maxPacketSize,
                                              UInt8				direction,
                                              UInt8				interval,
                                              UInt32            maxBurstAndMult);
    
    // obsolete method
    virtual IOReturn UIMCreateIsochTransfer(short					functionAddress,
                                            short					endpointNumber,
                                            IOUSBIsocCompletion		completion,
                                            UInt8					direction,
                                            UInt64					frameStart,
                                            IOMemoryDescriptor		*pBuffer,
                                            UInt32					frameCount,
                                            IOUSBIsocFrame			*pFrames);
	
    virtual IOReturn UIMCreateIsochTransfer(IOUSBIsocCommand *command);
    
    virtual IOReturn UIMAbortStream(UInt32		streamID,
                                    short		functionNumber,
                                    short		endpointNumber,
                                    short		direction);
	
    virtual IOReturn UIMAbortEndpoint(short				functionNumber,
                                      short				endpointNumber,
                                      short				direction);
    
    virtual IOReturn UIMDeleteEndpoint(short				functionNumber,
                                       short				endpointNumber,
                                       short				direction);
    
    virtual IOReturn UIMClearEndpointStall(short				functionNumber,
                                           short				endpointNumber,
                                           short				direction);
    
    virtual UInt32			UIMMaxSupportedStream(void);
    
	
    
    virtual void		UIMRootHubStatusChange(void);
    virtual void 		UIMRootHubStatusChange( bool abort );
	
    IOReturn configureHub(UInt32 address, UInt32 flags);
	
    virtual IOReturn 		UIMHubMaintenance(USBDeviceAddress highSpeedHub, UInt32 highSpeedPort, UInt32 command, UInt32 flags);
    virtual IOReturn		UIMSetTestMode(UInt32 mode, UInt32 port);
    virtual UInt32			GetPortSCForWriting(short port);
    virtual IOReturn 		GetRootHubDeviceDescriptor( IOUSBDeviceDescriptor *desc );
    virtual IOReturn 		GetRootHubDescriptor( IOUSBHubDescriptor *desc );
    virtual IOReturn 		GetRootHub3Descriptor( IOUSB3HubDescriptor *desc );
    virtual IOReturn 		SetRootHubDescriptor( OSData *buffer );
    virtual IOReturn 		GetRootHubBOSDescriptor( OSData *desc );
    virtual IOReturn 		GetRootHubConfDescriptor( OSData *desc );
    virtual IOReturn 		GetRootHubStatus( IOUSBHubStatus *status );
    virtual IOReturn 		SetRootHubFeature( UInt16 wValue );
    virtual IOReturn		ClearRootHubFeature( UInt16 wValue );
    virtual IOReturn 		GetRootHubPortStatus( IOUSBHubPortStatus *status, UInt16 port );
    virtual IOReturn 		SetRootHubPortFeature( UInt16 wValue, UInt16 port );
    virtual IOReturn 		ClearRootHubPortFeature( UInt16 wValue, UInt16 port );
    virtual IOReturn 		GetRootHubPortState( UInt8 *state, UInt16 port );
    virtual IOReturn 		SetHubAddress( UInt16 wValue );
    virtual IOReturn 		GetRootHubPortErrorCount( UInt16 port, UInt16 *count );
    
    
    virtual UInt32 		GetBandwidthAvailable( void );
    virtual UInt64 		GetFrameNumber( void );
    virtual UInt64 		GetMicroFrameNumber( void );
    virtual UInt32 		GetFrameNumber32( void );
    
    
    // this call is not gated, so we need to gate it ourselves
    virtual IOReturn								GetFrameNumberWithTime(UInt64* frameNumber, AbsoluteTime *theTime);
    // here is the gated version
    static IOReturn									GatedGetFrameNumberWithTime(OSObject *owner, void* arg0, void* arg1, void* arg2, void* arg3);
    
    // Debugger polled mode
    virtual void 		PollInterrupts( IOUSBCompletionAction safeAction = 0 );
	
	
	
    
    virtual IOReturn GetRootHubStringDescriptor(UInt8	index, OSData *desc);
    
    
    // in the new IOUSBControllerV3 class
    virtual void        ControllerSleep(void);
    virtual	IOReturn	ResetControllerState(void);
    virtual IOReturn	RestartControllerFromReset(void);
    virtual	IOReturn	SaveControllerStateForSleep(void);
    virtual	IOReturn	RestoreControllerStateFromSleep(void);
    virtual IOReturn	DozeController(void);
    virtual IOReturn	WakeControllerFromDoze(void);
    virtual IOReturn	UIMEnableAddressEndpoints(USBDeviceAddress address, bool enable);
    virtual IOReturn	UIMEnableAllEndpoints(bool enable);
    virtual IOReturn	EnableInterruptsFromController(bool enable);
    
    // Overriding the controller V3 method to get hub port info
    virtual  IOReturn	ConfigureDeviceZero(UInt8 maxPacketSize, UInt8 speed, USBDeviceAddress hub, int port);
    
	
	virtual IOReturn    GetBandwidthAvailableForDevice(IOUSBDevice *forDevice, UInt32 *pBandwidthAvailable);

	virtual IOReturn	UIMDeviceToBeReset(short functionAddress);
	bool				checkEPForTimeOuts(int slot, int endp, UInt32 stream, UInt32 curFrame);
	void				CheckSlotForTimeouts(int slot, UInt32 frame);
	virtual void		UIMCheckForTimeouts(void);

	virtual USBDeviceAddress	UIMGetActualDeviceAddress(USBDeviceAddress current);
	
	virtual IOUSBControllerIsochEndpoint*			AllocateIsochEP();
	
	virtual IODMACommand*							GetNewDMACommand();
	
    // Internal routines
    IOReturn  XHCIRootHubPower(bool on);
    IOReturn  XHCIRootHubPowerPort(UInt16 port, bool on);
    IOReturn  XHCIRootHubEnablePort(UInt16 port, bool enable);
    IOReturn  XHCIRootHubSuspendPort(UInt8 RHSpeed, UInt16 adjustedPort, bool suspend);
    IOReturn  XHCIRootHubClearPortConnectionChange(UInt16 port);
    IOReturn  XHCIRootHubClearPortEnableChange(UInt16 port);
    IOReturn  XHCIRootHubClearPortSuspendChange(UInt16 port);
    IOReturn  XHCIRootHubResetOverCurrentChange(UInt16 port);
    IOReturn  XHCIRootHubClearResetChange(UInt8 RHSpeed, UInt16 adjustedPort);
	IOReturn  XHCIRootHubClearWarmResetChange(UInt16 port);
	IOReturn  XHCIRootHubClearPortLinkChange(UInt16 port);
	IOReturn  XHCIRootHubClearConfigErrorChange(UInt16 port);
    
    
	IOReturn  XHCIRootHubResetPort (UInt8 RHSpeed, UInt16 port);
	IOReturn  XHCIRootHubWarmResetPort (UInt16 port);
	IOReturn  XHCIRootHubSetLinkStatePort (UInt16 linkState, UInt16 port);
	IOReturn  XHCIRootHubSetU1TimeoutPort (UInt16 timeout, UInt16 port);
	IOReturn  XHCIRootHubSetU2TimeoutPort (UInt16 timeout, UInt16 port);
	IOReturn  XHCIRootHubRemoteWakeupMaskPort (UInt16 mask, UInt16 port);
    
	void            DecodeExtendedCapability();
	void            DecodeSupportedProtocol(XHCIXECPRegistersPtr protocolBase);
	void            AdjustRootHubPortNumbers(UInt8 speed, UInt16 *port);
    UInt16          GetCompanionRootPort(UInt8 speed, UInt16 adjustedPort);
    bool            IsRootHubPortSuperSpeed(UInt16 *port);
    
	IOReturn PlacePortInMode(UInt32 port, UInt32 mode);
	IOReturn LeaveTestMode();
	IOReturn EnterTestMode();
    void EnableComplianceMode();
    void DisableComplianceMode();
	
	IOReturn StopUSBBus();
    void RestartUSBBus();    
    
    const char *TRBType(int type);
    const char *EndpointState(int state);

	// Isoc management
	IOReturn		ScavengeAnIsocTD(AppleXHCIIsochEndpoint *pEP,  AppleXHCIIsochTransferDescriptor *pTD);
	IOReturn		ScavengeIsocTransactions(AppleXHCIIsochEndpoint *pEP, bool reQueueTransactions);
    void			AddIsocFramesToSchedule(AppleXHCIIsochEndpoint* pEP);
    IOReturn		AbortIsochEP(AppleXHCIIsochEndpoint* pEP);
    IOReturn		DeleteIsochEP(AppleXHCIIsochEndpoint* pEP);

    // Async SW Endpoints Managment
    AppleXHCIAsyncEndpoint  *AllocateAppleXHCIAsyncEndpoint(XHCIRing *ring, UInt32 maxPacketSize, UInt32 maxBurst, UInt32 mult);
	
#if (DEBUG_REGISTER_READS == 1)
private:
	UInt64 fTempReg;
#endif
};


#endif
